ws/resources/objectRepo/xmlTemplates/MDM/HotelConfig/req_ChangeHousekeepingTasks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:ChangeHousekeepingTasksRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Tasks>
            <v91:Task HotelCode="?">
               <v91:Code/>
               <v91:Description/>
               <v91:Instructions/>
               <v91:Sequence/>
               <v91:Color/>
               <v91:LinenChange/>
               <v91:GuestRequested/>
               <v91:DefaultDepartureTask/>
               <v91:Protected/>
               <v91:AppliedCreditsPercentage/>
               <v91:Inactive/>
            </v91:Task>
         </v9:Tasks>
      </v9:ChangeHousekeepingTasksRQ>
   </soapenv:Body>
</soapenv:Envelope>